# Используем официальный образ Node.js (16-й версии)
FROM node:18.17.1-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем package.json и package-lock.json (или yarn.lock) для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install --include=dev

# Копируем весь остальной код проекта в контейнер
COPY . .

# Строим приложение для продакшн (если у тебя есть процесс сборки)
#RUN npm run build

# Открываем порт, на котором будет работать сервер
EXPOSE 3000

# Запускаем приложение
CMD ["npm", "run", "dev"]
